reddit_on_rails/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "all about yodelling"], ["description", "you learn"], ["moderator_id", 2], ["created_at", "2021-02-15 21:45:58.461046"], ["updated_at", "2021-02-15 21:45:58.461046"]]
---
    def create
        # @sub = Sub.new(sub_params)
        @sub = current_user.subs.new(sub_params)
        # @sub.moderator_id = current_user
        unless @sub.save