reddit_on_rails/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ctMyMVl_metGG1ysGvE6HA"], ["updated_at", "2021-02-15 21:30:40.553173"], ["id", 1]]
---
    def reset_session_token!
        self.update!(session_token: SecureRandom.urlsafe_base64) && self.session_token